package com.rencai.service.user_service.utils;

/**
 * =======================================================
 *
 * @Company :金色家网络科技有限公司-开发测试云服务部
 * @Date ：2019--16
 * @Author :zhoujia
 * @Version :0.0.1
 * @Description : 定义错误码
 * ========================================================
 */
public enum DataErrorCode {

    SUCCESS("000000", "调用成功"),
    SUCCESS_code("success", "调用成功"),
    CODE_200101("200101", "数据库操作失败"),
    CODE_200102("200102", "用户已经存在"),
    CODE_200103("200103", "用户不存在或者权限不足"),
    CODE_200104("200104", "用户名或者密码错误"),
    CODE_200105("200105", "验证码错误"),
    CODE_200106("200106", "禁止登录,请稍后再试"),
    CODE_200107("200107", "注册失败"),
    CODE_200108("200108", "一分钟只能收发一次验证码"),
    CODE_200109("200109", "一天只能请求5次短信验证码,请明天再试"),
    CODE_200110("200110", "邮箱已经被用户注册"),
    CODE_200111("200111", "用户中心更新失败"),
    CODE_200112("200112", "必须登录才能修改邮箱"),
    CODE_200113("200113", "新密码不能与旧密码相同"),
    CODE_200114("200114", "邮箱为空或者格式不正确"),
    CODE_200115("200115", "手机号不能为空"),
    CODE_200116("200116", "参数不能为空"),
    CODE_200117("200117", "旧密码不正确"),
    CODE_200118("200118", "推荐码不存在"),
    CODE_200119("200119", "推荐码已经使用过"),

    CODE_201000("201000", "充值成功"),
    CODE_201001("201001", "余额不足"),
    CODE_201002("201002", "充值异常"),
    CODE_201003("201003", "消费异常"),
    CODE_201004("201004", "入账异常"),

    CODE_201005("201005", "金币充值异常"),
    CODE_201006("201006", "金币余额不足"),
    CODE_201007("201007", "金币消费异常"),

    ZHANWEI("", "");


    private String code;
    private String msg;


    private DataErrorCode(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public String getCode() {
        return code;
    }


    public String getMsg() {
        return msg;
    }
}
